<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"3d66f5275c01f35306626abea79cd81bbfddc17b5daae5a343e223115e525e6b","plan_job_ref":"Job PR Plan #9 at https://github.com/tyng94/tyng94/actions/runs/6983644565","plan_hash":"cda3ec58aaee5bdacd8e1631ba274c22b0fd0aab8bda6ae0f9be9b3d10c848ba","plan_text_format":"text","version":"1.37.0"} -->
Terraform plan in ___infrastructure__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.terraformer will be created
  + resource "aws_iam_role" "terraformer" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::758106943541:user/CI"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "terraformer"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.terraformer_policy will be created
  + resource "aws_iam_role_policy" "terraformer_policy" {
      + id          = (known after apply)
      + name        = "terraformer"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:*",
                          + "iam:*",
                          + "kms:*",
                          + "logs:*",
                          + "rds:*",
                          + "s3:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "terraformer"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform Apply #7](https://github.com/tyng94/tyng94/actions/runs/6983650181)